---
kind: method
id: M:Autodesk.Revit.DB.OverrideGraphicSettings.SetCutForegroundPatternVisible(System.Boolean)
source: html/52d77752-fa56-6fec-8948-73a1887f2bc6.htm
---
# Autodesk.Revit.DB.OverrideGraphicSettings.SetCutForegroundPatternVisible Method

Sets the visibility of the cut face foreground fill pattern.

## Syntax (C#)
```csharp
public OverrideGraphicSettings SetCutForegroundPatternVisible(
	bool fillPatternVisible
)
```

## Parameters
- **fillPatternVisible** (`System.Boolean`) - Value of the visibility of the cut face foreground fill pattern.

## Returns
Reference to the changed object.